podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/UART1_MKM14ZA5_C7816.svd.xml
            <register>
               <name>PFIFO</name>
               <description>FIFO Parameters</description>
               <addressOffset>0x10</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXFIFOSIZE</name>
                     <description>Receive FIFO Depth</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>1 dataword</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>4 datawords</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>8 datawords</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>16 datawords</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>32 datawords</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>64 datawords</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>128 datawords</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>Reserved</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXFE</name>
                     <description>Receive FIFO Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RXFIFOSIZE" > <name>TXFIFOSIZE</name> <description>Transmit FIFO Buffer Depth</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="RXFE" > <name>TXFE</name> <description>Transmit FIFO Enable</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>CFIFO</name>
               <description>FIFO Control Register</description>
               <addressOffset>0x11</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXUFE</name>
                     <description>Receive FIFO Underflow Interrupt Enable\n
If this bit is set, the RXUF flag generates an interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RXUFE" > <name>TXOFE</name> <description>Transmit FIFO Overflow Interrupt Enable\n
If this bit is set, the TXOF flag generates an interrupt</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="RXUFE" > <name>RXOFE</name> <description>Receive FIFO Overflow Interrupt Enable\n
If this bit is set, the RXOF flag generates an interrupt</description> <bitOffset>2</bitOffset> </field>
                  <field>
                     <name>RXFLUSH</name>
                     <description>Receive FIFO/Buffer Flush\n
Writing to this field causes all data that is stored in the receive FIFO/buffer to be flushed.\n
This does not affect data that is in the receive shift register</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to flush</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RXFLUSH" > <name>TXFLUSH</name> <description>Transmit FIFO/Buffer Flush\n
Writing to this field causes all data that is stored in the transmit FIFO/buffer to be flushed.\n
This does not affect data that is in the transmit shift register</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SFIFO</name>
               <description>FIFO Status Register</description>
               <addressOffset>0x12</addressOffset>
               <size>8</size>
               <resetValue>0xC0</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXUF</name>
                     <description>Receiver Buffer Underflow Flag\n
Indicates that more data has been read from the receive buffer than was present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Error</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RXUF" > <name>TXOF</name> <description>Transmitter Buffer Overflow Flag\n
Indicates that more data has been written to the transmit buffer than it can hold</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="RXUF" > <name>RXOF</name> <description>Receiver Buffer Overflow Flag\n
Indicates that more data has been written to the receive buffer than it can hold</description> <bitOffset>2</bitOffset> </field>
                  <field>
                     <name>RXEMPT</name>
                     <description>Receive Buffer/FIFO Empty</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Buffer not empty</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Buffer empty</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RXEMPT" > <name>TXEMPT</name> <description>Transmit Buffer/FIFO Empty</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>TWFIFO</name>
               <description>FIFO Transmit Watermark</description>
               <addressOffset>0x13</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>TXWATER</name>
                     <description>Transmit Watermark</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCFIFO</name>
               <description>FIFO Transmit Count</description>
               <addressOffset>0x14</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>TXCOUNT</name>
                     <description>Transmit Counter</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>RWFIFO</name>
               <description>FIFO Receive Watermark</description>
               <addressOffset>0x15</addressOffset>
               <size>8</size>
               <resetValue>0x1</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXWATER</name>
                     <description>Receive Watermark</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>RCFIFO</name>
               <description>FIFO Receive Count</description>
               <addressOffset>0x16</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXCOUNT</name>
                     <description>Receive Counter</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>C7816</name>
               <description>7816 Control Register</description>
               <addressOffset>0x18</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>ISO_7816E</name>
                     <description>ISO-7816 Functionality Enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TTYPE</name>
                     <description>Transfer Type\nIndicates the transfer protocol being used</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>ISO-7816 T = 0 specification</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>ISO-7816 T = 1 specification</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INIT</name>
                     <description>Detect Initial Character\n
When this field is set, all received characters are searched for a valid initial character.\n
If an invalid initial character is identified, and ANACK is set, a NACK is sent</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operating mode\t- Receiver does not seek to identify initial character</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Search mode\t- Receiver searches for initial character</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ANACK</name>
                     <description>Generate NACK on Error\n
A NACK may be automatically generated if a parity error is detected or if an invalid initial character is detected</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No action</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Send NACK</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ANACK" > <name>ONACK</name> <description>Generate NACK on Overflow\n
A NACK may be automatically sent if a receive buffer overrun occurs</description> <bitOffset>4</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>IE7816</name>
               <description>7816 Interrupt Enable Register</description>
               <addressOffset>0x19</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXTE</name>
                     <description>Receive Threshold Exceeded Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RXTE" > <name>TXTE</name> <description>Transmit Threshold Exceeded (TXT) Interrupt Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="RXTE" > <name>GTVE</name> <description>Guard Timer Violated (GTV) Interrupt Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="RXTE" > <name>INITDE</name> <description>Initial Character Detected (INITD) Interrupt Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="RXTE" > <name>BWTE</name> <description>Block Wait Timer (BWT) Interrupt Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="RXTE" > <name>CWTE</name> <description>Character Wait Timer (CWT) Interrupt Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="RXTE" > <name>WTE</name> <description>Wait Timer Interrupt Enable</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>IS7816</name>
               <description>7816 Interrupt Status Register</description>
               <addressOffset>0x1A</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXT</name>
                     <description>Receive Threshold Exceeded Interrupt\n
Set if the number of consecutive NACKS generated as a result of parity errors and buffer overruns is &gt;= the value in ET7816[RXTHRESHOLD]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Negated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Asserted/Write 1 to clear</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RXT" > <name>TXT</name> <description>Transmit Threshold Exceeded Interrupt\n
Set if the number of retries and corresponding NACKS &gt; the value in the ET7816[TXTHRESHOLD] field</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>GTV</name> <description>Guard Timer Violated Interrupt\n
Set if a guard time (GT, CGT or BGT) has been violated</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>INITD</name> <description>Initial Character Detected Interrupt\n
Set when a valid initial character has been received</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>BWT</name> <description>Block Wait Timer Interrupt\n
Set when the Block Wait Time (BWT) has been violated</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>CWT</name> <description>Character Wait Timer Interrupt\n
Set when the Character Wait Time (CWT) has been violated</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>WT</name> <description>Wait Timer Interrupt\n
Set when the Wait Time (WT) has been violated</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>WP7816T0</name>
               <description>7816 Wait Parameter Register</description>
               <addressOffset>0x1B</addressOffset>
               <size>8</size>
               <resetValue>0xA</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WI</name>
                     <description>Wait Time Integer (C7816[TTYPE] = 0)</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>WP7816T1</name>
               <description>7816 Wait Parameter Register</description>
               <addressOffset>0x1B</addressOffset>
               <size>8</size>
               <resetValue>0xA</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>BWI</name>
                     <description>Block Wait Time Integer(C7816[TTYPE] = 1)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CWI</name>
                     <description>Character Wait Time Integer (C7816[TTYPE] = 1)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WN7816</name>
               <description>7816 Wait N Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>GTN</name>
                     <description>Guard Band N</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>WF7816</name>
               <description>7816 Wait FD Register</description>
               <addressOffset>0x1D</addressOffset>
               <size>8</size>
               <resetValue>0x1</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>GTFD</name>
                     <description>FD Multiplier</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
